8_Agile Software Engineering - UC Berkeley/hw-part1/hw03/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')
---
  def index
    # set sorting
    sort = params[:sort] || session[:sort]
    case sort
    when 'title'
      ordering = :title
      @title_header = 'hilite'
    when 'release_date'
      ordering = :release_date
      @date_header = 'hilite'
    end

    # get selected ratings
    @all_ratings = Movie.all_ratings
    @selected_ratings = params[:ratings] || session[:ratings] || {}

    # if none selected, then show all
    if @selected_ratings == {}
      @selected_ratings = Hash[@all_ratings.map { |rating| [rating, rating] }]